---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalElement.AnalyzeAs
source: html/571db5af-db0b-c5a0-afc0-746c80cf9721.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalElement.AnalyzeAs Property

This represents the Analyze As parameter assigned to Analytical Element.

## Syntax (C#)
```csharp
public AnalyzeAs AnalyzeAs { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The provided AnalyzeAs is not supported
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration